In [1]:
import pandas as pd
import numpy as np

In [31]:
society_data = pd.read_csv('Society.csv')
society_data

     Unnamed: 0             Society      Range    Neighbourhood            Max
0             0    Akshaya Republic  Rs. 4,972            Kovur  5,398/sq. ft.
1             1       Altis Ashraya  Rs. 4,378          Mangadu  4,462/sq. ft.
2             2       Arihant Tiara  Rs. 6,375     Nandambakkam  6,375/sq. ft.
3             3  Bharathi Brikhouse  Rs. 5,185        Vanagaram  5,610/sq. ft.
4             4      Dugar Sky City  Rs. 5,185        Vanagaram  6,078/sq. ft.
..          ...                 ...        ...              ...            ...
164         164       RWD Lemongraz  Rs. 4,462         Ambattur  5,185/sq. ft.
165         165     S And P Essense  Rs. 4,420        Agraharam  5,015/sq. ft.
166         166       The Metrozone  Rs. 6,800  Anna Nagar West  9,010/sq. ft.
167         167         Vgn Platina  Rs. 3,188       Ayappakkam  3,570/sq. ft.
168         168        VGN Stafford  Rs. 4,038         Ambattur  4,462/sq. ft.

[169 rows x 5 columns]

In [47]:
society_data[['Range','Min']]=society_data.Range.str.split(' ',expand=True)
society_data.head()

   Unnamed: 0             Society Range Neighbourhood            Max    Min
0           0    Akshaya Republic   Rs.         Kovur  5,398/sq. ft.  4,972
1           1       Altis Ashraya   Rs.       Mangadu  4,462/sq. ft.  4,378
2           2       Arihant Tiara   Rs.  Nandambakkam  6,375/sq. ft.  6,375
3           3  Bharathi Brikhouse   Rs.     Vanagaram  5,610/sq. ft.  5,185
4           4      Dugar Sky City   Rs.     Vanagaram  6,078/sq. ft.  5,185

In [51]:
society_data.dtypes

Unnamed: 0        int64
Society          object
Range            object
Neighbourhood    object
Max              object
Min              object
dtype: object

In [55]:
society_data['Min'] = society_data['Min'].apply(lambda x: x.replace(',',''))

In [56]:
society_data.head()

   Unnamed: 0             Society Range Neighbourhood            Max   Min
0           0    Akshaya Republic   Rs.         Kovur  5,398/sq. ft.  4972
1           1       Altis Ashraya   Rs.       Mangadu  4,462/sq. ft.  4378
2           2       Arihant Tiara   Rs.  Nandambakkam  6,375/sq. ft.  6375
3           3  Bharathi Brikhouse   Rs.     Vanagaram  5,610/sq. ft.  5185
4           4      Dugar Sky City   Rs.     Vanagaram  6,078/sq. ft.  5185

In [57]:
society_data.dtypes

Unnamed: 0        int64
Society          object
Range            object
Neighbourhood    object
Max              object
Min              object
dtype: object

In [59]:
society_data['Min'] = society_data['Min'].astype('int')
society_data.dtypes

Unnamed: 0        int64
Society          object
Range            object
Neighbourhood    object
Max              object
Min               int64
dtype: object

In [60]:
society_data.describe(include='all')

,Unnamed: 0,Society,Range,Neighbourhood,Max,Min
count,169.000000,169,169,167,169,169.000000
unique,NaN,169,1,79,101,NaN
top,NaN,Adroit House Of Ambal,Rs.,Sholinganallur,"4,802/sq. ft.",NaN
freq,NaN,1,169,12,5,NaN
mean,84.000000,NaN,NaN,NaN,NaN,5734.727811
std,48.930222,NaN,NaN,NaN,NaN,3440.212768
min,0.000000,NaN,NaN,NaN,NaN,2295.000000
25%,42.000000,NaN,NaN,NaN,NaN,3868.000000
50%,84.000000,NaN,NaN,NaN,NaN,4718.000000
75%,126.000000,NaN,NaN,NaN,NaN,6205.000000
max,168.000000,NaN,NaN,NaN,NaN,25458.000000

In [45]:
society_data['Min'] = society_data.Range.str.extract('(\d)') + society_data.Range.str.extract('(\d\d\d)')
society_data.head()

,Unnamed: 0,Society,Range,Neighbourhood,Max,Min
0,0,Akshaya Republic,"Rs. 4,972",Kovur,"5,398/sq. ft.",4972
1,1,Altis Ashraya,"Rs. 4,378",Mangadu,"4,462/sq. ft.",4378
2,2,Arihant Tiara,"Rs. 6,375",Nandambakkam,"6,375/sq. ft.",6375
3,3,Bharathi Brikhouse,"Rs. 5,185",Vanagaram,"5,610/sq. ft.",5185
4,4,Dugar Sky City,"Rs. 5,185",Vanagaram,"6,078/sq. ft.",5185

In [36]:
society_data.describe(include='object')

                      Society      Range   Neighbourhood            Max   Min
count                     169        169             167            169   169
unique                    169         91              79            101    91
top     Adroit House Of Ambal  Rs. 5,185  Sholinganallur  4,802/sq. ft.  5185
freq                        1          6              12              5     6

In [37]:
society_data['Min'].isnull().sum()

0

In [38]:
society_data['Min'].astype('int')

0      4972
1      4378
2      6375
3      5185
4      5185
       ...
164    4462
165    4420
166    6800
167    3188
168    4038
Name: Min, Length: 169, dtype: int64

In [39]:
society_data.describe(include='all')

,Unnamed: 0,Society,Range,Neighbourhood,Max,Min
count,169.000000,169,169,167,169,169
unique,NaN,169,91,79,101,91
top,NaN,Adroit House Of Ambal,"Rs. 5,185",Sholinganallur,"4,802/sq. ft.",5185
freq,NaN,1,6,12,5,6
mean,84.000000,NaN,NaN,NaN,NaN,NaN
std,48.930222,NaN,NaN,NaN,NaN,NaN
min,0.000000,NaN,NaN,NaN,NaN,NaN
25%,42.000000,NaN,NaN,NaN,NaN,NaN
50%,84.000000,NaN,NaN,NaN,NaN,NaN
75%,126.000000,NaN,NaN,NaN,NaN,NaN
max,168.000000,NaN,NaN,NaN,NaN,NaN

In [43]:
society_data['Min'].dropna(axis=0)
society_data.shape

(169, 6)

In [2]:
chennai_data=pd.read_csv('Chennai_data.csv')
chennai_data.head()

   Unnamed: 0 Neighbourhood             Society   Min   Max
0           0         Kovur    Akshaya Republic  4972  5398
1           1       Mangadu       Altis Ashraya  4378  4462
2           2  Nandambakkam       Arihant Tiara  6375  6375
3           3     Vanagaram  Bharathi Brikhouse  5185  5610
4           4     Vanagaram      Dugar Sky City  5185  6078

In [36]:
chennai_data.shape

(169, 5)

In [34]:
chennai_data.reset_index()
chennai_data.head()

   Unnamed: 0 Neighbourhood             Society   Min   Max
0           0         Kovur    Akshaya Republic  4972  5398
1           1       Mangadu       Altis Ashraya  4378  4462
2           2  Nandambakkam       Arihant Tiara  6375  6375
3           3     Vanagaram  Bharathi Brikhouse  5185  5610
4           4     Vanagaram      Dugar Sky City  5185  6078

In [35]:
chennai_da = chennai_data[['Neighbourhood','Society','Min','Max']]
chennai_society_grp = chennai_da[['Neighbourhood','Society']].groupby(['Neighbourhood']).count()
chennai_society_grp.head()

               Society
Neighbourhood
Adambakkam           1
Adyar                1
Agraharam            1
Alandur              1
Ambattur             4

In [23]:
chennai_society_grp.loc['Sholinganallur','Society']

12

In [25]:
chennai_rate_grp= chennai_data[['Neighbourhood','Min','Max']].groupby(['Neighbourhood']).mean()
chennai_rate_grp.head()

                    Min       Max
Neighbourhood
Adambakkam      7820.00   9392.00
Adyar          13515.00  13898.00
Agraharam       4420.00   5015.00
Alandur         6672.00   6672.00
Ambattur        4441.25   4908.75

In [28]:
type(chennai_rate_grp)

pandas.core.frame.DataFrame

In [30]:
chennai = pd.concat([chennai_society_grp,chennai_rate_grp],axis=1)
chennai.head()

               Society       Min       Max
Neighbourhood
Adambakkam           1   7820.00   9392.00
Adyar                1  13515.00  13898.00
Agraharam            1   4420.00   5015.00
Alandur              1   6672.00   6672.00
Ambattur             4   4441.25   4908.75

In [31]:
chennai.loc['Sholinganallur','Min']

5408.166666666667

In [ ]:
df = df.groupby('source') \
       .agg({'text':'size', 'sent':'mean'}) \
       .rename(columns={'text':'count','sent':'mean_sent'}) \
       .reset_index()

In [32]:
chennai_grpd = chennai_data.groupby('Neighbourhood').agg({'Society':'size','Min':'mean','Max':'mean'})\
.rename(columns={'Society':'Number_of_societies','Min':'Average_min','Max':'Average_max'}).reset_index()
chennai_grpd.head()

  Neighbourhood  Number_of_societies  Average_min  Average_max
0    Adambakkam                    1      7820.00      9392.00
1         Adyar                    1     13515.00     13898.00
2     Agraharam                    1      4420.00      5015.00
3       Alandur                    1      6672.00      6672.00
4      Ambattur                    4      4441.25      4908.75

In [37]:
url = 'https://github.com/yankarto/Chennai_neighborhood_coordinates/blob/06a39db571b019e80502d906c8095e18a7a9d475/Chennai_neighbourhood_coordintes.csv'

In [38]:
geo_code = pd.read_csv(url)
geo_code.head()

ParserError: Error tokenizing data. C error: Expected 1 fields in line 72, saw 2

In [20]:
chennai_data[chennai_data['Neighbourhood']=='Sholinganallur']

     Unnamed: 0   Neighbourhood                     Society   Min   Max
32           32  Sholinganallur            Adroit Artistica  7352  8245
49           49  Sholinganallur       Appaswamy Greensville  6248  6842
57           57  Sholinganallur              ASV Alexandria  6375  6758
58           58  Sholinganallur    Baashyaam Pinnacle Crest  7395  8288
63           63  Sholinganallur  BSCPL Bollineni Hillside 2  4505  4675
64           64  Sholinganallur          Casagrand Amethyst  5482  5695
70           70  Sholinganallur            Casagrand Royale  4548  4718
84           84  Sholinganallur           Embassy Residency  4718  5142
93           93  Sholinganallur            KG Chandra Vista  5100  5908
113         113  Sholinganallur         Prestige Courtyards  5525  5610
122         122  Sholinganallur           Radiance Sapphire  4590  5142
138         138  Sholinganallur               TNHB Lig Flat  3060  3612

In [12]:
chennai_data['Neighbourhood'].value_counts()

Sholinganallur    12
Medavakkam         7
Pallavaram         6
Thoraipakkam       6
Porur              5
                  ..
Potheri            1
Mambakkam          1
Ayanambakkam       1
Kovilambakkam      1
Saidapet           1
Name: Neighbourhood, Length: 79, dtype: int64